# PolymeshTopology Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PolymeshTopology Methods
PolymeshTopology Class See Also
---
The PolymeshTopology type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFacet | Returns a definition of one facet |
| GetFacets | Returns a definitions of all facets of the polymesh |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetNormal | Returns a normal vector at the given index |
| GetNormals | Returns all normals assigned to the polymesh |
| GetPoint | Returns one point at the given index. |
| GetPoints | Returns all points of the polymesh. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetUV | Returns one UV coordinate at the given index. |
| GetUVs | Returns all UV coordinates assigned to the polymesh |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace